using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.ComponentModel;


namespace InterferogramProcessing {
    //---------------------------------------------------------------------------------------------------
    //---------------------------------------------------------------------------------------------------
    //Режим отображения графика
    public enum GraphShowingMode {
        [Description("Градации серого")]
        GrayScale,
        [Description("Красный")]
        Red,
        [Description("Зеленый")]
        Green,
        [Description("Синий")]
        Blue,
        [Description("Фаза")]
        Phase
    }
    //---------------------------------------------------------------------------------------------------
    //---------------------------------------------------------------------------------------------------
    //---------------------------------------------------------------------------------------------------
}
